Метеорологическая служба вашего города решила исследовать погоду новым способом.

Под температурой воздуха в конкретный день будем понимать максимальную температуру в этот день.
Под хаотичностью погоды за n дней служба понимает количество дней,
в которые температура строго больше, чем в день до (если такой существует) и в день после текущего (если такой существует). 
Например, если за 5 дней максимальная температура воздуха составляла [1, 2, 5, 4, 8] градусов, 
то хаотичность за этот период равна 2: в 3-й и 5-й дни выполнялись описанные условия.
Определите по ежедневным показаниям температуры хаотичность погоды за этот период.

Заметим, что если число показаний n=1, то единственный день будет хаотичным.

Формат ввода
В первой строке дано число n –— длина периода измерений в днях, 1 ≤ n≤ 105. 
Во второй строке даны n целых чисел –— значения температуры в каждый из n дней. 
Значения температуры не превосходят 273 по модулю.

Формат вывода
Выведите единственное число — хаотичность за данный период.


from typing import List


def сhaotic_weather(days: int, items: List[int]) -> int:
    count_of_chaotic = 0
    if days == 1:
        return 1
    if items[-1] > items[-2]:
        count_of_chaotic += 1
    if items[0] > items[1]:
        count_of_chaotic += 1
    for index in range(1, days - 1):
        if items[index-1] < items[index] > items[index+1]:
            count_of_chaotic += 1
    return count_of_chaotic


if __name__ == '__main__':
    print(сhaotic_weather(
            int(input()),
            [int(item) for item in input().split()]
        )
    )
